SiliconLabs/wfx-fullMAC-tools/Examples/SiliconLabs/commissioning/bare_metal/EFR32xG21/src/lwip_bm.c
  if (use_dhcp_client) {
    ip_addr_set_zero_ip4(&sta_ipaddr);
    ip_addr_set_zero_ip4(&sta_netmask);
    ip_addr_set_zero_ip4(&sta_gw);
  } else {
    IP_ADDR4(&sta_ipaddr, sta_ip_addr0, sta_ip_addr1, sta_ip_addr2, sta_ip_addr3);
    IP_ADDR4(&sta_netmask, sta_netmask_addr0, sta_netmask_addr1, sta_netmask_addr2, sta_netmask_addr3);
    IP_ADDR4(&sta_gw, sta_gw_addr0, sta_gw_addr1, sta_gw_addr2, sta_gw_addr3);
  }
  /* Initialize the SoftAP information */
  IP_ADDR4(&ap_ipaddr, ap_ip_addr0, ap_ip_addr1, ap_ip_addr2, ap_ip_addr3);
  IP_ADDR4(&ap_netmask, ap_netmask_addr0, ap_netmask_addr1, ap_netmask_addr2, ap_netmask_addr3);
  IP_ADDR4(&ap_gw, ap_gw_addr0, ap_gw_addr1, ap_gw_addr2, ap_gw_addr3);

  /* Initialize the WF200 used by the two interfaces */
  status = sl_wfx_init(&wifi);
  printf("FMAC Driver version    %s\r\n", FMAC_DRIVER_VERSION_STRING);
  switch (status) {
    case SL_STATUS_OK:
      wifi.state = SL_WFX_STARTED;
      printf("WF200 Firmware version %d.%d.%d\r\n",
             wifi.firmware_major,
             wifi.firmware_minor,
             wifi.firmware_build);
      printf("WF200 initialization successful\r\n");
      wfx_init_ok = true;
      break;
    case SL_STATUS_WIFI_INVALID_KEY:
      printf("Failed to init WF200: Firmware keyset invalid\r\n");
      break;
    case SL_STATUS_WIFI_FIRMWARE_DOWNLOAD_TIMEOUT:
      printf("Failed to init WF200: Firmware download timeout\r\n");
      break;
    case SL_STATUS_TIMEOUT:
      printf("Failed to init WF200: Poll for value timeout\r\n");
      break;
    case SL_STATUS_FAIL:
      printf("Failed to init WF200: Error\r\n");
      break;
    default:
      printf("Failed to init WF200: Unknown error\r\n");
  }

  if (wfx_init_ok) {
    // Add station and softAP interfaces
    netif_add(&sta_netif, &sta_ipaddr, &sta_netmask, &sta_gw, NULL, &sta_ethernetif_init, &ethernet_input);
    netif_add(&ap_netif, &ap_ipaddr, &ap_netmask, &ap_gw, NULL, &ap_ethernetif_init, &ethernet_input);

    //  Registers the default network interface.
    netif_set_default(&sta_netif);

    sl_wfx_start_ap_command(softap_channel, (uint8_t*) softap_ssid,
                            strlen(softap_ssid), 0, 0, softap_security, 0,
                            (uint8_t*) softap_passkey, strlen(softap_passkey),
                            NULL, 0, NULL, 0);
    printf ("IP address : %d.%d.%d.%d\r\n",
            ap_ip_addr0,
            ap_ip_addr1,
            ap_ip_addr2,
            ap_ip_addr3);
  }
}

/***************************************************************************//**
 * @brief
 *    LwIP main loop
 *
 * @param[in]
 *    none
 *
 * @return
 *    none
 ******************************************************************************/
void lwip_bm_process(void)
{

  sys_check_timeouts();

  if ((sta_netif.ip_addr.addr) && (print_addr))
  {
    // Print IP address if valid
    print_addr = 0;
    // Print MAC address
    printf("IP address : %d.%d.%d.%d\r\n",
           (uint8_t)sta_netif.ip_addr.addr,
           (uint8_t)(sta_netif.ip_addr.addr >> 8),
           (uint8_t)(sta_netif.ip_addr.addr >> 16),
           (uint8_t)(sta_netif.ip_addr.addr >> 24));
  }
}

